_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_22 (LSTM)               (None, 128)               239616    
_________________________________________________________________
dense_22 (Dense)             (None, 339)               43731     
=================================================================
Total params: 283,347
Trainable params: 283,347
Non-trainable params: 0
_________________________________________________________________
